In [25]:
import pandas as pd
import numpy as np

# Create a DataFrame manually
data = {
    "Name": ["Amit", "Riya", "Karan", "Sneha", "Amit", "Vijay", "Pooja", "Ravi", "Neha", "Riya"],
    "Age": [25, 22, 28, 24, 25, 30, 26, 29, 23, 22],
    "City": ["Delhi", "Mumbai", "Bangalore", "Chennai", "Delhi",
             "Hyderabad", "Pune", "Kolkata", "Jaipur", "Mumbai"],
    "Salary": [50000, 45000, 60000, np.nan, 50000,
               70000, 55000, np.nan, 48000, 45000]
}

df = pd.DataFrame(data)

print("Original DataFrame:")
print(df)
df

Original DataFrame:
    Name  Age       City   Salary
0   Amit   25      Delhi  50000.0
1   Riya   22     Mumbai  45000.0
2  Karan   28  Bangalore  60000.0
3  Sneha   24    Chennai      NaN
4   Amit   25      Delhi  50000.0
5  Vijay   30  Hyderabad  70000.0
6  Pooja   26       Pune  55000.0
7   Ravi   29    Kolkata      NaN
8   Neha   23     Jaipur  48000.0
9   Riya   22     Mumbai  45000.0

    Name  Age       City   Salary
0   Amit   25      Delhi  50000.0
1   Riya   22     Mumbai  45000.0
2  Karan   28  Bangalore  60000.0
3  Sneha   24    Chennai      NaN
4   Amit   25      Delhi  50000.0
5  Vijay   30  Hyderabad  70000.0
6  Pooja   26       Pune  55000.0
7   Ravi   29    Kolkata      NaN
8   Neha   23     Jaipur  48000.0
9   Riya   22     Mumbai  45000.0

In [26]:
print("\nDataFrame Info:")
df.info()

print("\nDataFrame Description:")
print(df.describe())

DataFrame Info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    10 non-null     object
 1   Age     10 non-null     int64
 2   City    10 non-null     object
 3   Salary  8 non-null      float64
dtypes: float64(1), int64(1), object(2)
memory usage: 452.0+ bytes

DataFrame Description:
             Age        Salary
count  10.000000      8.000000
mean   25.400000  52875.000000
std     2.836273   8559.664546
min    22.000000  45000.000000
25%    23.250000  47250.000000
50%    25.000000  50000.000000
75%    27.500000  56250.000000
max    30.000000  70000.000000

In [27]:
print("\nSelected Columns (Name & City):")
print(df[['Name', 'City']])

Selected Columns (Name & City):
    Name       City
0   Amit      Delhi
1   Riya     Mumbai
2  Karan  Bangalore
3  Sneha    Chennai
4   Amit      Delhi
5  Vijay  Hyderabad
6  Pooja       Pune
7   Ravi    Kolkata
8   Neha     Jaipur
9   Riya     Mumbai

In [28]:
df.drop(columns=["City"],inplace=True)
df

    Name  Age   Salary
0   Amit   25  50000.0
1   Riya   22  45000.0
2  Karan   28  60000.0
3  Sneha   24      NaN
4   Amit   25  50000.0
5  Vijay   30  70000.0
6  Pooja   26  55000.0
7   Ravi   29      NaN
8   Neha   23  48000.0
9   Riya   22  45000.0

In [29]:
df.isnull()

    Name    Age  Salary
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False    True
4  False  False   False
5  False  False   False
6  False  False   False
7  False  False    True
8  False  False   False
9  False  False   False

In [30]:
df['salry']=df['Salary'].fillna(df['Salary'].mean())
df

    Name  Age   Salary    salry
0   Amit   25  50000.0  50000.0
1   Riya   22  45000.0  45000.0
2  Karan   28  60000.0  60000.0
3  Sneha   24      NaN  52875.0
4   Amit   25  50000.0  50000.0
5  Vijay   30  70000.0  70000.0
6  Pooja   26  55000.0  55000.0
7   Ravi   29      NaN  52875.0
8   Neha   23  48000.0  48000.0
9   Riya   22  45000.0  45000.0

In [31]:
df.duplicated()

0    False
1    False
2    False
3    False
4     True
5    False
6    False
7    False
8    False
9     True
dtype: bool

In [33]:
df=df.drop_duplicates()
df

    Name  Age   Salary    salry
0   Amit   25  50000.0  50000.0
1   Riya   22  45000.0  45000.0
2  Karan   28  60000.0  60000.0
3  Sneha   24      NaN  52875.0
5  Vijay   30  70000.0  70000.0
6  Pooja   26  55000.0  55000.0
7   Ravi   29      NaN  52875.0
8   Neha   23  48000.0  48000.0